ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new \App\Models\ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q != '') $builder->like('artikel.judul', $q);
        if ($kategori_id != '') $builder->where('artikel.id_kategori', $kategori_id);

        $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
        $data['q'] = $q;
        $data['kategori_id'] = $kategori_id;
        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---

        // SOLUSI: Tarik data kategori dari model sebelum merender View
        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();