ci4/app/Controllers/Api/Auth.php

    public function login()
    {
        // === TAMBAHKAN 3 BARIS INI ===
        header('Access-Control-Allow-Origin: *');
        header('Access-Control-Allow-Headers: *');
        header('Access-Control-Allow-Methods: *');
        // =============================

        // Ambil data input
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();

        // Cari user berdasarkan username atau email
        $user = $model->where('username', $username)
                      ->orWhere('useremail', $username)
                      ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin@gmail.com'
OR `useremail` = 'admin@gmail.com'
 LIMIT 1